#include <stdio.h>

int main()
{
    int a = 1;
    int b = -1;
    // 1原码 00000000 00000000 00000000 00000001
    // 1反码 00000000 00000000 00000000 00000001
    // 1补码 00000000 00000000 00000000 00000001
    // -1原码 10000000 00000000 00000000 00000001
    // -1反码 11111111 11111111 11111111 11111110
    // -1补码 11111111 11111111 11111111 11111111
    int x = a >> 1; // 二进制右移符号，补码右移一位，符号位补原符号位
    int y = b >> 1;
    int z = a << 1; // 二进制左移符号，补码左移一位，符号位补原符号位
    int w = b << 1;
    // 计算机计算用补码，输出用原码
    int i = a & b; // 与计算符号，比特都为1时，输出为1，否则为0
    int j = a | b; // 或计算符号，比特都为0时，输出为0，否则为1
    int k = a ^ b; // 异或计算符号，比特相同为0，不同为1
    printf("%d %d\n", x, y);
    printf("%d %d", z, w);
    return 0;
}